Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz8110ca80144.h
#define PIN_PB11F_TCC1_WO1                         _UINT32_(43)
#define MUX_PB11F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PB11F_TCC1_WO1                      ((PIN_PB11F_TCC1_WO1 << 16) | MUX_PB11F_TCC1_WO1)
#define PORT_PB11F_TCC1_WO1                        (_UINT32_(1) << 11)

#define PIN_PB12F_TCC1_WO2                         _UINT32_(44)
#define MUX_PB12F_TCC1_WO2                         _UINT32_(5) 
#define PINMUX_PB12F_TCC1_WO2                      ((PIN_PB12F_TCC1_WO2 << 16) | MUX_PB12F_TCC1_WO2)
#define PORT_PB12F_TCC1_WO2                        (_UINT32_(1) << 12)

#define PIN_PB13F_TCC1_WO3                         _UINT32_(45)
#define MUX_PB13F_TCC1_WO3                         _UINT32_(5) 
#define PINMUX_PB13F_TCC1_WO3                      ((PIN_PB13F_TCC1_WO3 << 16) | MUX_PB13F_TCC1_WO3)
#define PORT_PB13F_TCC1_WO3                        (_UINT32_(1) << 13)

#define PIN_PB14F_TCC1_WO4                         _UINT32_(46)
#define MUX_PB14F_TCC1_WO4                         _UINT32_(5) 
#define PINMUX_PB14F_TCC1_WO4                      ((PIN_PB14F_TCC1_WO4 << 16) | MUX_PB14F_TCC1_WO4)
#define PORT_PB14F_TCC1_WO4                        (_UINT32_(1) << 14)

#define PIN_PB15F_TCC1_WO5                         _UINT32_(47)
#define MUX_PB15F_TCC1_WO5                         _UINT32_(5) 
#define PINMUX_PB15F_TCC1_WO5                      ((PIN_PB15F_TCC1_WO5 << 16) | MUX_PB15F_TCC1_WO5)
#define PORT_PB15F_TCC1_WO5                        (_UINT32_(1) << 15)

#define PIN_PB16F_TCC1_WO6                         _UINT32_(48)
#define MUX_PB16F_TCC1_WO6                         _UINT32_(5) 
#define PINMUX_PB16F_TCC1_WO6                      ((PIN_PB16F_TCC1_WO6 << 16) | MUX_PB16F_TCC1_WO6)
#define PORT_PB16F_TCC1_WO6                        (_UINT32_(1) << 16)

#define PIN_PB17F_TCC1_WO7                         _UINT32_(49)
#define MUX_PB17F_TCC1_WO7                         _UINT32_(5) 
#define PINMUX_PB17F_TCC1_WO7                      ((PIN_PB17F_TCC1_WO7 << 16) | MUX_PB17F_TCC1_WO7)
#define PORT_PB17F_TCC1_WO7                        (_UINT32_(1) << 17)

/* ========== PORT definition for TCC2 peripheral ========== */
#define PIN_PD10F_TCC2_WO0                         _UINT32_(106)
#define MUX_PD10F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PD10F_TCC2_WO0                      ((PIN_PD10F_TCC2_WO0 << 16) | MUX_PD10F_TCC2_WO0)
#define PORT_PD10F_TCC2_WO0                        (_UINT32_(1) << 10)

#define PIN_PD11F_TCC2_WO1                         _UINT32_(107)
#define MUX_PD11F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PD11F_TCC2_WO1                      ((PIN_PD11F_TCC2_WO1 << 16) | MUX_PD11F_TCC2_WO1)
#define PORT_PD11F_TCC2_WO1                        (_UINT32_(1) << 11)

#define PIN_PD12F_TCC2_WO2                         _UINT32_(108)
#define MUX_PD12F_TCC2_WO2                         _UINT32_(5) 
#define PINMUX_PD12F_TCC2_WO2                      ((PIN_PD12F_TCC2_WO2 << 16) | MUX_PD12F_TCC2_WO2)
#define PORT_PD12F_TCC2_WO2                        (_UINT32_(1) << 12)

#define PIN_PA04F_TCC2_WO3                         _UINT32_(4) 
#define MUX_PA04F_TCC2_WO3                         _UINT32_(5) 
#define PINMUX_PA04F_TCC2_WO3                      ((PIN_PA04F_TCC2_WO3 << 16) | MUX_PA04F_TCC2_WO3)
#define PORT_PA04F_TCC2_WO3                        (_UINT32_(1) << 4)

#define PIN_PA03F_TCC2_WO4                         _UINT32_(3) 
#define MUX_PA03F_TCC2_WO4                         _UINT32_(5) 
#define PINMUX_PA03F_TCC2_WO4                      ((PIN_PA03F_TCC2_WO4 << 16) | MUX_PA03F_TCC2_WO4)
#define PORT_PA03F_TCC2_WO4                        (_UINT32_(1) << 3)

#define PIN_PA02F_TCC2_WO5                         _UINT32_(2) 
#define MUX_PA02F_TCC2_WO5                         _UINT32_(5) 
#define PINMUX_PA02F_TCC2_WO5                      ((PIN_PA02F_TCC2_WO5 << 16) | MUX_PA02F_TCC2_WO5)
#define PORT_PA02F_TCC2_WO5                        (_UINT32_(1) << 2)

/* ========== PORT definition for TCC3 peripheral ========== */
#define PIN_PA05F_TCC3_WO0                         _UINT32_(5) 
#define MUX_PA05F_TCC3_WO0                         _UINT32_(5) 
#define PINMUX_PA05F_TCC3_WO0                      ((PIN_PA05F_TCC3_WO0 << 16) | MUX_PA05F_TCC3_WO0)
#define PORT_PA05F_TCC3_WO0                        (_UINT32_(1) << 5)

#define PIN_PA06F_TCC3_WO1                         _UINT32_(6) 
#define MUX_PA06F_TCC3_WO1                         _UINT32_(5) 
#define PINMUX_PA06F_TCC3_WO1                      ((PIN_PA06F_TCC3_WO1 << 16) | MUX_PA06F_TCC3_WO1)
#define PORT_PA06F_TCC3_WO1                        (_UINT32_(1) << 6)

/* ========== PORT definition for TCC4 peripheral ========== */
#define PIN_PC12F_TCC4_WO0                         _UINT32_(76)
#define MUX_PC12F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PC12F_TCC4_WO0                      ((PIN_PC12F_TCC4_WO0 << 16) | MUX_PC12F_TCC4_WO0)
#define PORT_PC12F_TCC4_WO0                        (_UINT32_(1) << 12)

#define PIN_PC29F_TCC4_WO0                         _UINT32_(93)
#define MUX_PC29F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PC29F_TCC4_WO0                      ((PIN_PC29F_TCC4_WO0 << 16) | MUX_PC29F_TCC4_WO0)
#define PORT_PC29F_TCC4_WO0                        (_UINT32_(1) << 29)

#define PIN_PC13F_TCC4_WO1                         _UINT32_(77)
#define MUX_PC13F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PC13F_TCC4_WO1                      ((PIN_PC13F_TCC4_WO1 << 16) | MUX_PC13F_TCC4_WO1)
#define PORT_PC13F_TCC4_WO1                        (_UINT32_(1) << 13)

#define PIN_PD13F_TCC4_WO1                         _UINT32_(109)
#define MUX_PD13F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PD13F_TCC4_WO1                      ((PIN_PD13F_TCC4_WO1 << 16) | MUX_PD13F_TCC4_WO1)
#define PORT_PD13F_TCC4_WO1                        (_UINT32_(1) << 13)

/* ========== PORT definition for TCC5 peripheral ========== */
#define PIN_PC08F_TCC5_WO0                         _UINT32_(72)
#define MUX_PC08F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PC08F_TCC5_WO0                      ((PIN_PC08F_TCC5_WO0 << 16) | MUX_PC08F_TCC5_WO0)
#define PORT_PC08F_TCC5_WO0                        (_UINT32_(1) << 8)

